<?php include("header.php") ?>
    <section>
      <div class="container">
        <div>
          <h2 style="margin-top:0px;">Спеціальність 121 «Інженерія програмного забезпечення»</h2>  
          <p><img src="img/Computer_Science.jpg" class="rightimg">Спеціальність дає можливість отримати одну з найбільш престижних професій IT-програміста, фахівці якої на сьогоднішній день є високооплачуваними і вкрай затребуваними.  В  процесі  навчання Ви опануєте програмування на сучасних алгоритмічних мовах, що входять до двадцяток  найвідоміших рейтингів (JavaScript, Java, PHP, Python, C#, C++, Ruby, R, Perl, Scala, Go, ABAP), познайомитеся з різними операційними системами (сімейства Linux, FreeBSD, Windows).</p>
          <p>Ви зможете навчитися створювати програмні продукти для мобільних пристроїв (iOS, Android), отримаєте знання в області організації роботи комп’ютерних мереж, програмування для Internet of Everything (IoE), дізнаєтесь, як працюють захищені системи, що таке комп’ютерна безпека і захист даних, виконуючи курсові роботи у вигляді реальних практичних задач, навчитесь створювати складне програмне забезпечення, управляти базами даних, моделювати системи.</p>
          <a href="#target">Ознайомтесь з нашим навчальним планом</a>
        </div>
      </div>
    </section>
    <section>
      <div class="container">
        <div>
          <div>
            <h2>Спеціалізації</h2>
          </div>
          <ul class="nav nav-pills" id="spec">
            <li class="active"><a href="#specialty1" data-toggle="tab">«Програмно-інформаційні <br>системи»</a></li>
            <li><a href="#specialty2" data-toggle="tab">«Теорія інформаційних систем» <br>&nbsp;</a></li>
            <li><a href="#specialty3" data-toggle="tab">«Програмування вбудованих <br>і мобільних систем (ВМС)»</a></li>
            <li><a href="#specialty4" data-toggle="tab">«Програмування<br> комп'ютерних ігор»</a></li>
            <li><a href="#specialty5" data-toggle="tab">«ERP програмування»<br> &nbsp; </a></li>
          </ul>

          <div class="tab-content">
            <div class="tab-pane active" id="specialty1">
              <div class="table-responsive" style="max-width: 100%; margin-top:20px">
                <table>
                  <tr>
                    <th>Студенти  отримають знання з</th>
                    <th>Це дозволить</th> 
                    <th>Що треба знати</th>
                    <th>Дисципліни, які треба вивчити</th>
                  </tr>
                  <tr>
                    <td>
                      <p>− основ алгоритмізації й програмування;</p>
                      <p>−об’єктно-орієнтованого й функціонального програмування;</p>
                      <p>−технологій розроблення програмного забезпечення;</p>
                      <p>−проектування програмного забезпечення;</p>
                      <p>− програмування операційних систем і системного програмування;</p>
                      <p>− кросплатформеного програмування;</p>
                      <p>- веб програмування;</p>
                      <p>- проектування й програмування баз даних;</p>
                      <p>- управління ІТ проектами й командами розробників.</p>
                    </td>
                    <td><p>− розробляти будь-які додатки для комп’ютерів, серверів, мобільних пристроїв;</p></td>
                    <td><p>Математику</p>
                      <p>Основи програмування</p>
                      <p>Об’єктно-орієнтоване програмування</p>
                      <p>Архітектуру ЕОМ</p>
                    </td>
                    <td><p>• Комп’ютерна графіка та візуалізація</p>
                      <p>• Емпірична методи програмної інженерія</p>
                      <p>• Конструювання програмного забезпечення</p>
                      <p>• Основи розподілених обчислень та паралельного програмування</p>
                      <p>• Економіка IT компаній</p>
                      <p>• Менеджмент командної розробки програмного забезпечення</p>
                      <p>• Кросплатформене програмування</p>
                      <p>• Хмарні технології</p>
                      <p>• Програмування інтернет речей (IoT)</p>
                    </td>
                  </tr>
                </table>
              </div>
            </div>
            <div class="tab-pane" id="specialty2">
               <div class="table-responsive" style="max-width: 100%; margin-top:20px">
                <table>
                  <tr>
                    <th>Студенти  отримають знання з</th>
                    <th>Це дозволить</th> 
                    <th>Що треба знати</th>
                    <th>Дисципліни, які треба вивчити</th>
                  </tr>
                  <tr>
                    <td>
                    <p>- формальних мов програмування;
                     <p> - з використання парадигм програмування;
                     <p>- методів збору й оброблення інформації;
                     <p> - специфікацій програмного забезпечення.

                    </td>
                    <td>
                     <p> - використовувати отримані знання в будь-якій галузі господарства;
                     <p> . займатися теорією програмного забезпечення;
                     <p> - розробляти нові парадигми програмування.

                    </td>
                    <td>
                     <p> Математику
                    <p>  Основи програмування
                    <p>  Об’єктно-орієнтоване програмування
                      Архітектуру ЕОМ
                    <p>  Специфікацію програмного забезпечення

                    </td>
                    <td>
                     <p> • Мовні процесори
                     <p> • Парадигми програмування
                     <p> • Інформаційна безпека
                     <p> • Українська мова (за професійним спрямуванням)
                    <p>  • Економіка програмного забезпечення
                    <p>  • Вбудовані системи реального часу
                    <p>  • Пакети прикладних програм
                    <p>  • Інтерактивні системи
                    <p>  • Формальні методи специфікації програм

                    </td>
                  </tr>
                </table>
              </div>
            </div>
            <div class="tab-pane" id="specialty3">
               <div class="table-responsive" style="max-width: 100%; margin-top:20px">
                <table>
                  <tr>
                    <th>Студенти  отримають знання з</th>
                    <th>Це дозволить</th> 
                    <th>Що треба знати</th>
                    <th>Дисципліни, які треба вивчити</th>
                  </tr>
                  <tr>
                    <td>
                     <p>- основ алгоритмізації й програмування;
                     <p>- структурної й функціональної організації програмно-апаратних електронних систем і комплексів;
                     <p>- функціонування цифрового (мікропроцесорного) обладнання;
                     <p>- технологій розроблення програмного забезпечення мобільних електронних систем і Інтернет-Додатків;
                    <p> - мов програмування вбудованих мікропроцесорних систем;
                    <p> - архітектури мікроконтролерів і їх програмування для мобільних електронних систем і комплексів;
                    <p> - програмування операційних систем і системного програмування; 
                    <p> - методів прогнозування надійності апаратних і програмних засобів мобільних електронних систем;
                   <p>  - основні галузі практичного використання, історію та перспективи розвитку ВМС;
                    <p> - особливості розробки кросплатформеного забезпечення ВМС;
                   <p>  - особливості апаратної реалізації, інтерфейси та периферійні пристрої, окремі аспекти сумісності виробів різних виробників при роботи в великих програмно-апаратних комплексах;
                   <p>  - особливості сучасних мікроконтролерів та сумісних з ними елементів, систем на чипі та можливості інтеграції вбудованих систем в великі комплекси, зокрема в межах інтернету речей.

                   </td>
                   <td>
                   <p> - створювати будь-які Smart додатки для IoT (інтернет речей) та для автономних систем автоматичного управління, побутових пристриїв, роботів;
                    - програмувати й тестувати мікропроцесорну техніку й/або комп'ютери, що вбудовується в програмно-апаратні комплекси (системи) для розв’язання конкретних функціональних завдань (smart побутова техніка, роботи, <p>беспілотні транспортні засоби, автоматизація виробництва тощо);
                  <p>  - програмувати й тестувати мобільне обладнання й системи; 
                  <p>  - програмувати й тестувати програмне забезпечення вбудованих та мобільних систем;
                  <p>  - забезпечувати за допомогою програмних методів можливість мобільного застосування апаратно-програмних комплексів і систем при їхній експлуатації;
                  <p>  - проектувати мобільні додатки;
                  <p>  - використовувати CASE-системи для <p>розробки вбудованих та мобільних систем;
                  <p>  - створювати script-розширення існуючих алгоритмічних мов для спрощення розробки та підтримки експлуатації програмного забезпечення вбудованих та мобільних систем.

                  </td>
                  <td>
                  <p>  Математику;
                  <p>  Основи програмування;
                  <p>  Основи побудови комп’ютерів;
                  <p>  Англійську мову (дуже бажано).

                  </td>
                  <td>
                   <p> • Програмування ВМС і ІоТ
                   <p> • Операційні системи ВМС
                  <p>  • CASE - системи для програмування ВМС
                  <p>  • Системи автоматизованого проектування в галузі ВМС
                 <p>   • Схемотехніка ВМС (з елементами нізькорівневого програмування)
                  <p>  • Програмування взаємодії ВМС з зовнішними пристроями
                  <p>  • Спеціалізоване програмування ВМС та ІоТ
                   <p> • Моделювання програмно-апаратних систем
                   <p> • Алгоритми ідентифікації та розпізнавання в ІоТ

                  </td><p>
                </tr>
              </table>
            </div>
          </div>
          <div class="tab-pane" id="specialty4">
             <div class="table-responsive" style="max-width: 100%; margin-top:20px">
              <table>
                <tr>
                  <th>Студенти  отримають знання з</th>
                  <th>Це дозволить</th> 
                  <th>Що треба знати</th>
                  <th>Дисципліни, які треба вивчити</th>
                </tr>
                <tr>
                  <td>
                  <p> - основ алгоритмізації й програмування;
                  <p> - методів структурної й функціональної організації апаратно-програмних електронних систем і комплексів;
                 <p>  - функціонування цифрових і мікропроцесорних обладнань;
                 <p>  - технологій розроблення програмного забезпечення мобільних електронних систем і Інтернет-Додатків;
                 <p>  - мов програмування вбудованих мікропроцесорних систем;
                 <p>  - архітектури мікроконтролерів і їх програмування для мобільних електронних систем і комплексів;
                 <p>  - програмування операційних систем і системного програмування; 
                 <p>  - методів прогнозування надійності апаратних і програмних засобів мобільних електронних систем.

                 </td>
                 <td>
                <p>  - створювати будь-які Smart додатки для IoT (інтернет речей);
                <p>  - програмувати й тестувати мікропроцесорну техніку й/або комп'ютери, що вбудовується в апаратно-програмні комплекси (системи) для розв’язання конкретних функціональних завдань;
                <p>  - програмувати й тестувати мобільне обладнання й системи; 
                <p>  - забезпечувати за допомогою програмних методів можливість мобільного застосування апаратно-програмних комплексів і систем при їхній експлуатації;
                <p>  - проектувати мобільні додатки.

                </td>
                <td>
                <p>  Математику;
                <p>  Основи програмування;
                <p>  Архітектуру ЕОМ;
                <p>  Комп'ютерні мережі.


                </td>
                <td>
                 <p> • Обчислювальна геометрія
                 <p> • Математичні основи комп'ютерних ігор
                <p>  • Комп’ютерне моделювання фізики природних явищ
                 <p> • Комп'ютерна графіка
                <p>  • Технології графічного дизайну
                <p>  • Програмування штучного інтелекту ігор
                <p>  • Програмування змішаної реальності
                <p>  • Архітектура комп'ютерних ігор і систем віртуальної реальності
               <p>   • Програмування багатокористувацьких ігор

                </td>
              </tr>
            </table>
          </div>
        </div>
        <div class="tab-pane" id="specialty5">
           <div class="table-responsive" style="max-width: 100%; margin-top:20px">
            <table>
              <tr>
                <th>Студенти  отримають знання з</th>
                <th>Це дозволить</th> 
                <th>Що треба знати</th>
                <th>Дисципліни, які треба вивчити</th>
              </tr>
              <tr>
                <td>
               <p>  - основ алгоритмізації й програмування;
               <p>  - методів структурної й функціональної організації автоматизованих систем управління підприємством (Enterprise Resource Planning, ERP-систем);
               <p>  - типової структури ERP-систем (управління фінансами. кадрами, кар’єрою, споживачами, ресурсами, логістикою, нерухомістю, бізнес-аналітикою);
               <p>  - основних галузей застосування (банкі, підпріємства, комерція, виробництво, технологічні процеси, освіта, силові відомства, медицина, транспорт, спорт, сфера розваг тощо);
               <p>  - функціонування та раціонального конфігурування апаратного базису ERP-систем;
               <p>  - технологій розроблення програмного забезпечення, особливостей мов програмування та особливостей використання вбудованих налаштувань ERP-систем;
               <p>  - архітектури мікроконтролерів і їх програмування для вбудованих та мобільних додатків ERP-систем; 
               <p>  - програмування операційних систем і системного програмування ERP-систем;
               <p>  - методів прогнозування надійності апаратних і програмних засобів ERP-систем.

               </td>
               <td>
             <p>   - виконувати функції консультанта ERP-систем (програмування на вбудованих алгоритмічних мовах та раціональне виконання вбудованих налаштувань);
             <p>   - проектувати структуру ERP-систем, виходячи з потреб замовника та існуючих ресурсних обмежень;
             <p>   - адмініструвати ERP-системи на всіх рівнях (апаратний, програмно-системний та нормативний в частині керування ліцензіями та захисту інтересів фахівців програмного профілю); 
             <p>   - інтегрувати ERP-системи з існуючими автономними програмними системами;
             <p>   - інтегрувати ERP-системи в програмно-апаратні комплекси сучасного управління технологічними процесами;
              <p>  - проектувати, ставити завдання та програмувати задачі щодо бізнес-аналітики на базі ERP-систем;
             <p>   - проектувати та реалізовувати інтерфейси користувачів ERP-систем у відповідності до постановки задачі;
             <p>   - організовувати роботу, виконувати налаштування та розробляти необхідні додаткові програмні продукти щодо забезпеченн необхідног рівню інформаційної безпеки;
             <p>   - организовувати та виконувати контроль якості ERP-систем, що розробляються;
             <p>   - використовувати вбудовані системи управління проектом розробки ERP-систем, в тому числі CASE-системи.

              </td>
              <td>
              <p>  Математику;
              <p>  Основи програмування;
             <p>   Основи побудови комп’ютерів;
             <p>   Англійську мову (дуже бажано).

              </td>
              <td>
              <p>  Основи ERP-систем
              <p>  • Програмування ERP-систем
              <p>  • Інтегрований проектний менеджмент ERP-систем
              <p>  • Програмно-апаратний базис ERP-систем
              <p>  • Інтеграція ERP систем та ІоТ
             <p>   • Програмні технології Big Data в ERP - системах
              <p>  • Економіка і маркетінг ERP- систем
              <p>  • Бізнес-аналітика ERP- систем
              <p>  • Розробка мультіплатформених рішень

              </td>
            </tr>
          </table>
        </div>
      </div>
      <a href="/info.pdf" class="staff-block-admin-a edit">Детальніше</a>
    </div>
  </div>
</div>
</section>
      <section>
      <div class="container">
        <div id="target">
          <h2 style="text-align:center">Навчальний план</h2>
          <h4>1.Нормативні навчальні дисципліни</h4>
        </div>
        <div class="clearfix wrapper">
          <div class="col-md-3 bg-text">
            <p>1. Вступ до університетських студій</p>
            <p>2. Іноземна мова за професійним спрямуванням </p>
            <p>3. Основи математики</p>
            <p>4. Дискретна математика  (з використанням інформаційних технологій)</p>
            <p>5. Основи програмування</p>
            <p>6. Вступ до об'єктно-орієнтованого програмування</p>
          </div>
          <div class="col-md-3 bg-text">
            <p>7. Основи програмної інженерії </p>
            <p>8. Об'єктно-орієнтоване конструювання програм </p>
            <p>9. Прикладна математика</p>
            <p>10.  Теорія ймовірностей та математична статистика  (з використанням інформаційних технологій)</p>
            <p>11.  Українська та зарубіжна культура </p>
            <p>12.  Науковий образ світу</p>
          </div>
          <div class="col-md-3 bg-text">
            <p>13.  SQL</p>
            <p>14.  Проектування баз даних</p>
            <p>15.  Основи екології</p>
            <p>16.  Архітектура та проектування програмного забезпечення</p>
            <p>17.  Аналіз вимог до програмного забезпечення</p>
            <p>18.  Філософія</p>
          </div>
          <div class="col-md-3 bg-text">
            <p>19.  Операційні системи</p>
            <p>20.  Менеджмент проектів програмного забезпечення</p>
            <p>21.  Веб-технології</p>
            <p>22.  Технологічна (виробнича) практика</p>
            <p>23.  Соціально-політичні студії </p>
            <p>24.  Вибрані розділи трудового права і основ підприємницької діяльності</p>
            <p>25.  Переддипломна (виробнича) практика </p>
          </div>
        </div>
        <div class=" clearfix wrapper">
        <div>
          <h4>2.Дисципліни вибору факультету</h4>
        </div>
        <div class="col-md-4 bg-text2">
          <p>1. Архітектура комп’ютера</p>
          <p>2. Алгоритми і структури даних</p>
          <p>3. Комп’ютерні мережі та технології</p>
          <p>4. Обчислювальні методи </p>
        </div>
        <div class="col-md-4 bg-text2">
          <p>5. Захист програм та даних</p>
          <p>6. Математичне моделювання процесів</p>
          <p>7. Курсова робота</p>
          <p>8. Спеціалізоване програмування автоматизованих систем</p>
        </div>
        <div class="col-md-4 bg-text2">
          <p>9. Якість програмного забезпечення та тестування</p>
          <p>10.  Додаткові розділи проектування програмного забезпечення</p>
          <p>11.  Дипломне проектування</p>
        </div>
        </div>
        <div class="clearfix wrapper">
        <div>
          <h4>3. Дисципліни вільного вибору студента</h4>
          <h4>3.1. Вибір за блоками</h4>
        </div>
        <div class="table-responsive" style="max-width: 100%; margin-top:20px">
            <table id="five-cells">
              <tr>
                <th>Спеціалізація 1. "Програмно-інформаційні системи"</th>
                <th>Спеціалізація 2.  "Теорія інформаційних систем"</th> 
                <th>Спеціалізація 3.  "Програмування вбудованих і мобільних систем (ВМС)"</th>
                <th>Спеціалізація 4.  "Програмування комп'ютерних ігор"</th>
                <th>Спеціалізація 5.  "ERP програмування"</th>
              </tr>
              <tr>
                <td>
                <p>1. Комп’ютерна графіка та візуалізація
                <p>2.  Емпірична методи програмної інженерія
                <p>3.  Конструювання програмного забезпечення
                 <p>4.  Основи розподілених обчислень та паралельного програмування
                 <p>5.  Економіка IT компаній
                 <p>6.  Менеджмент командної розробки програмного забезпечення
                 <p>7.  Кросплатформне програмування 
                 <p>8.  Хмарні технології 
                 <p>9.  Програмування інтернет речей (IoT)

               </td>
               <td>
               <p>1.  Мовні процесори
               <p>2.  Парадигми програмування 
               <p>3.  Інформаційна безпека
                <p>4.  Українська мова (за професійним спрямуванням)
                <p>5.  Економіка програмного забезпечення
                <p>6.  Вбудовані системи реального часу
                <p>7.  Пакети прикладних програм
                <p>8.  Інтерактивні системи
                <p>9.  Формальні методи специфікації програм

              </td>
              <td>
              <p>1.  Програмування ВМС
              <p>2.  Операційні системи ВМС
              <p>3.  CASE - системи для програмування ВМС
                <p>4.  Системи автоматизованого проектування в галузі ВМС 
                <p>5.  Схемотехніка ВМС (з елементами нізькорівневого програмування)
                <p>6.  Програмування взаємодії ВМС з зовнішними пристроями
                <p>7.  Спеціалізоване програмування ВМС
                <p>8.  Моделювання програмно-апаратних систем
                <p>9.  Алгоритми ідентифікації та розпізнавання

              </td>
              <td>
              <p>1.  Обчислювальна геометрія 
              <p>2.  Математичні основи комп'ютерних ігор
              <p>3.  Комп’ютерне моделювання фізики природних явищ
                <p>4.  Комп'ютерна графіка
                <p>5.  Технології графічного дизайну 
                <p>6.  Програмування штучного інтелекту ігор
                <p>7.  Програмування змішаної реальності
                <p>8.  Архітектура комп'ютерних ігор і систем віртуальної реальності
                <p>9.  Програмування багатокористувацьких ігор 

              </td>
              <td>
              <p>1.  Основи ERP-систем
              <p>2.  Програмування ERP-систем
              <p>3.  Інтегрований проектний менеджмент ERP-систем
                <p>4.  Програмно-апаратний базис ERP-систем
                <p>5.  Інтеграція ERP систем
                <p>6.  Програмні технології Big Data в ERP - системах
                <p>7.  Економіка і маркетінг ERP- систем 
                <p>8.  Бізнес-аналітика ERP- систем 
                <p>9.  Розробка мультіплатформених рішень

              </td>
            </tr>
          </table>
        </div>
        </div>
        <div class="clearfix wrapper">
        <div>
          <h4>3.2. Вибір з переліку (студент обирає 1 дисципліну з кожного переліку)</h4>
        </div>
        <div class="table-responsive" style="max-width: 100%; margin-top:20px">
            <table >
              <tr>
                <th>Перелік № 1</th>
                <th>Перелік № 2</th> 
                <th>Перелік № 3</th>
              </tr>
              <tr>
                <td>
                <p>1.  Розробка мультимедійних та ігрових систем (рекомендовано завідувачем)я
                <p>2. Моделювання інформаційних систем та бізнес систем
               </td>
               <td>
               <p>1.  Функціональне програмування (рекомендовано завідувачем)
               <p>2.  Основи зворотної розробки
              </td>
              <td>
              <p>1. Програмування під мобільні платформи (рекомендовано завідувачем)
              <p>2. Стандартизація програмного забезпечення
              </td>
            </tr>
          </table>
        </div>
        </div>
      </div>
      </section>
      <section>
        <div class="container">
          <div class="wrapper">
            <h2 class="center-text">Предмети на ЗНО</h2>
          </div>
          <div class="icons clearfix">
            <div class="col-md-3 center-text">
              <img src="ico/ua_icon.png">
              <div>
                <h4>Українська мова</h4>
              </div>
            </div>
            <div class="col-md-3 center-text">
              <img src="ico/math_icon.png">
              <div>
                <h4>Математика</h4>
              </div>
            </div>
            <div class="col-md-3 center-text">
              <img src="ico/english_icon.png">
              <div>
                <h4>Англійська мова</h4>
              </div>
            </div>
            <div class="col-md-3 center-text">
              <img src="ico/phisics_icon.png">
              <div>
                <h4>або Фізика</h4>
              </div>
            </div>
          </div>
<!--           <div class="col-md-4" style="margin-top: -10px; display: none">
          <h4 style="color:#fc5a56">БОНУС</h4>
          <p>ВПЕРШЕ В УКРАЇНІ (Наказ МОН): додатково <strong>до 20 балів</strong> переможцям (необхідно набрати більше 90 балів) університетської олімпіади з математики! Стань <strong>ПЕРЕМОЖЦЕМ!</strong></p>
          </div> -->
        </div>
      </section>
      <section>
      <div class="container">
        <div class="wrapper">
          <h2 class="center-text" style="background: aliceblue">Основні знання</h2>
        </div>
        <div class="clearfix wrapper">
          <div class="col-md-4">
            <p>•  <strong>Основи компьютінгу</strong> (основи інформатики, технології й засоби розробки, формальні методи);</p>
            <p>•  <strong>Основи математики й інженерії</strong> (у тому числі економіка ПЗ, маркетинг ПЗ);</p>
            <p>•  <strong>Професійна практика</strong> (робота в команді, навички комунікації, етика);</p>
          </div>
          <div class="col-md-4">
            <p>•  <strong>Основи моделювання</strong> (аналіз, робота з вимогами, специфікації ПЗ);</p>
            <p>•  <strong>Проектування ПЗ</strong> (концепції й стратегії проектування, проектування людино-машинного інтерфейсу, засобів підтримки проектування);</p>
            <p>•  <strong>Верифікація й атестація ПЗ</strong> (основи, рефакторінг коду, тестування, оцінка користувацького інтерфейсу, аналіз проблем);</p>
          </div>
          <div class="col-md-4">
            <p>•  <strong>Процеси розробки ПЗ</strong>: аналіз вимог, проектування, кодування, тестування й налагодження;</p>
            <p>•  <strong>Якість ПЗ</strong> (стандарти якості ПЗ, процеси забезпечення якості ПЗ, процесу, продукту);</p>
            <p>•  <strong>Управління програмними проектами</strong> за технологіями PMBOK, XP-extremal programing Agile, SCRUM, P2M (управління інтеграцією, управління змістом, управління термінами, управління вартістю, управління якістю, управління персоналом, управління інформаційними зв’язками, управління ризиками, управління закупівлями, управління взаємодією).</p>
          </div>
        </div>
      </div>
      </section>
      <section>
      <div class="container">
      <div class="wrapper">
          <h2 style="background:#fbf4eb">Функціональні й посадові обов'язки фахівця «Інженерії програмного забезпечення»</h2>
            <p><img src="ico/Automation-Icon.png" class="rightimg small" />• Збір і аналіз вихідних даних для проектування програмного забезпечення;</p>
            <p>• Проведення техніко-економічного обґрунтування проектних розв'язків при концептуальному програмуванні;</p>
            <p>• Розроблення алгоритмів розв'язання задач відповідно до існуючого технічного завдання;</p>
            <p>• Розроблення програмного забезпечення з використанням алгоритмічних мов;</p>
            <p>• Використання сервісів Інтернет і Веб - технологій при реалізації розподілених інформаційних систем;</p>
            <p>• Інсталяція програм і програмних систем, налагодження й обслуговування програмно - апаратних комплексів;</p>
            <p>• Розроблення проектної й робочої документації, оформлення закінчених проектних робіт;</p>
            <p>• Верифікація програмних рішень, контроль відповідності проектів, що реалізовані до технічної документації, стандартів, технічних умов і іншим нормативним документам;</p>
            <p>• Використання стандартів і методів контролю якості програмної документації.</p>
          </p>
          </div>
      </div>
      </section>
      <section>
        <div class="container">
          <div class="wrapper">
            <div>
              <h2 class="center-text">Області професійної діяльності фахівця з <br> «Інженерії програмного забезпечення»</h2>
            </div>
            <div class="clearfix jobs">
            <div class="col-xs-4 center-text no-float">
              <img src="ico/piggy-bank.svg">
              <div class="margin-top">
              <p>Сфера <strong>бізнесу</strong>, у якому використовуються програмні системи й інформаційні технології;</p>
              </div>
            </div>
            <div class="col-xs-4 center-text no-float">
              <img src="ico/computer.svg">
              <div class="margin-top">
              <p><strong>Розробка конкурентноздатного програмного забезпечення</strong> для фінансового, виробничого, телекомунікаційного сектору економіки, охорони здоров'я, індустрії розваг, підприємств торгівлі, урядових закладів, оборонної промисловості тощо.</p>
              </div>
            </div>
            <div class="col-xs-4 center-text no-float">
              <img src="ico/user.svg">
              <div class="margin-top">
              <p>Сфера <strong>замовленого програмування й програмного аутсорсінгу</strong></p>
              </div>
            </div>
            </div>
          </div>
        </div>
      </section>
       <section>
      <div class="container">
      <div class="wrapper">
          <h2 style="background:#e9ffdc">Об'єкти професійної діяльності фахівця з «Інженерії програмного забезпечення»</h2>
          <div class="col-md-6">
            <p>•  програми, програмні системи й комплекси, їх математичні й алгоритмічні моделі;</p>
            <p>•  методи проектування й реалізації;</p>
            </div>
            <div class="col-md-6">
            <p>•  способи виробництва й експлуатації в різних областях;</p>
            <p>•  автоматизовані системи обробки інформації й керування;</p>
            <p>•  системи автоматизованого проектування.</p>
            </div>
          </p>
          </div>
      </div>
      </section>
      <section>
      <div class="container">
      <div class="wrapper">
          <h2 style="background:#fbf4eb">Вимоги до індивідуальних здібностей фахівця з «Інженерії програмного забезпечення»</h2>
            <p><img src="ico/employee-classes-1-1.png" class="leftimg" />- абстрактне й системне мислення; уважність; акуратність; терплячість; наполегливість; цілеспрямованість; відповідальність; уміння працювати в команді; незалежність; схильність до інтелектуальних видів діяльності; висока мотивація до творчої діяльності, самонавчання, аналітичність (здатність виділяти окремі елементи дійсності, здатність до класифікації) мислення, стратегічне мислення;</p>
            <p>- оперативність (швидкість розумових процесів, інтелектуальна лабільність) мислення.</p>
            <p><strong>Переваги професії</strong>: високий заробіток, постійний попит на фахівців, різноманітність діяльності, робота творча й дуже цікава.</p>
            <p><strong>Оплата праці й кар'єра. </strong>Одна з найбільш актуальних, затребуваних і високооплачуваних на сьогоднішній день професійних областей. Випускники даного напрямку можуть працювати в будь-якій галузі. Важливі складові успішного кар'єрного росту в програмній інженерії - розуміння особливостей функціонування різних моделей програмного забезпечення й систематичний моніторинг інновацій.</p>
          </p>
          </div>
      </div>
      </section>
      <section>
        <div class="container">
          <div class="wrapper">
            <div>
              <h2>Додаткова інформація...</h2>
            </div>
            <div>
            <p>Подвійний диплом бакалавра «Інженерії програмного забезпечення».</p>
            <p><strong><img src="ico/loguniv1.gif" class="rightimg small"> Бажаєте отримати диплом українського університету, і ще додатково французького?</strong></p>
            <p>Тоді факультет інформаційних технологій Київського національного університету імені Тараса Шевченка чекає на Вас! У березні 2016 року підписано угоду про Академічне партнерство між Київським національним університетом імені Тараса Шевченка і університетом міста Ле Ман (Франція).</p>
            <p>Тепер студенти, що навчаються на спеціальності «Інженерія програмного забезпечення» можуть проходити навчання у Франції (оплачує навчання фонд «Еразмус+») та отримувати дипломи двох університетів після 4-х років навчання. Навчання проводиться за таким планом. Перші два роки студент навчається в нашому університеті, третій курс в університеті ЛеМан і останній курс знову в Києві.</p>
            <p>Колектив кафедри Програмних систем і технологій (завідувач Бичков О.С.) і студенти висловлюють щиру подяку ректору нашого університету Леоніду Васильовичу Губерському і проректору Петру Олексійовичу Беху за підтримку нашої ініціативи!</p>
            </div>
          </div>
        </div>
      </section>
      <hr>
<?php include("footer.php") ?>
</body>

</html>