<?php include("header.php"); ?>
    <div class="container">
        <section>
            <div class="wrapper2">
                <div class="col-md-7">
                    <div class="staff-header">
                         <h2>Про кафедру</h2>
                         <p>Кафедра програмних систем і технологій заснована у 2014 році.</p>
                         <p>На кафедрі працюють висококваліфіковані викладачі, які володіють фундаментальними математичними знаннями та сучасними інформаційними технологіями, мають значний педагогічний досвід, є сертифікованими фахівцями <strong>Microsoft</strong>. </p>
                         <p>Кафедра програмних систем і технологій здійснює навчання студентів за напрямами: <strong>121 “Інженерія програмного забезпечення”.</strong> Фахівці з <strong>«Інформатики»</strong> орієнтовані на розробку прикладного програмного забезпечення із застосуванням сучасних технологій програмування.</p>
                     </div>
                     <div class="href">
                         <a href="abiturient.php" class="admin-control">Дізнатися більше</a>
                     </div>
                </div>   
                <div class="col-md-5">
                    <img src="img/by-right.svg" />
                </div>
            </div>
        </section>
    </div>
<?php include("footer.php"); ?>
