<?php include("header.php"); ?>

<div class="container">
    <div class="clearfix services-header-container margin-top">
        <div class="services-header">
            <h2>Комерційні послуги кафедри з використанням IT-технологій</h2>
        </div>
    </div>
    <section>
        <div class="services-container">
            <div class='services-list'>
                <hr>
                <div class="service-item">
                   <div id="target">
                        <h2 style="text-align:center">Web та мережі</h2>
                    </div>
                    <div class="clearfix wrapper">
                        <div class="col-md-3 bg-text">
                            <p>1. Вступ до університетських студій</p>
                            <p>2. Іноземна мова за професійним спрямуванням </p>
                            <p>3. Основи математики</p>
                            <p>4. Дискретна математика  (з використанням інформаційних технологій)</p>
                            <p>5. Основи програмування</p>
                            <p>6. Вступ до об'єктно-орієнтованого програмування</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>7. Основи програмної інженерії </p>
                            <p>8. Об'єктно-орієнтоване конструювання програм </p>
                            <p>9. Прикладна математика</p>
                            <p>10.  Теорія ймовірностей та математична статистика  (з використанням інформаційних технологій)</p>
                            <p>11.  Українська та зарубіжна культура </p>
                            <p>12.  Науковий образ світу</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>13.  SQL</p>
                            <p>14.  Проектування баз даних</p>
                            <p>15.  Основи екології</p>
                            <p>16.  Архітектура та проектування програмного забезпечення</p>
                            <p>17.  Аналіз вимог до програмного забезпечення</p>
                            <p>18.  Філософія</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>19.  Операційні системи</p>
                            <p>20.  Менеджмент проектів програмного забезпечення</p>
                            <p>21.  Веб-технології</p>
                            <p>22.  Технологічна (виробнича) практика</p>
                            <p>23.  Соціально-політичні студії </p>
                            <p>24.  Вибрані розділи трудового права і основ підприємницької діяльності</p>
                            <p>25.  Переддипломна (виробнича) практика </p>
                        </div>
                    </div>
                </div>   
                <hr>
                <div class="service-item">
                   <div id="target">
                        <h2 style="text-align:center">Програмне забезпечення</h2>
                    </div>
                    <div class="clearfix wrapper">
                        <div class="col-md-3 bg-text2">
                            <p>1. Вступ до університетських студій</p>
                            <p>2. Іноземна мова за професійним спрямуванням </p>
                            <p>3. Основи математики</p>
                            <p>4. Дискретна математика  (з використанням інформаційних технологій)</p>
                            <p>5. Основи програмування</p>
                            <p>6. Вступ до об'єктно-орієнтованого програмування</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>7. Основи програмної інженерії </p>
                            <p>8. Об'єктно-орієнтоване конструювання програм </p>
                            <p>9. Прикладна математика</p>
                            <p>10.  Теорія ймовірностей та математична статистика  (з використанням інформаційних технологій)</p>
                            <p>11.  Українська та зарубіжна культура </p>
                            <p>12.  Науковий образ світу</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>13.  SQL</p>
                            <p>14.  Проектування баз даних</p>
                            <p>15.  Основи екології</p>
                            <p>16.  Архітектура та проектування програмного забезпечення</p>
                            <p>17.  Аналіз вимог до програмного забезпечення</p>
                            <p>18.  Філософія</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>19.  Операційні системи</p>
                            <p>20.  Менеджмент проектів програмного забезпечення</p>
                            <p>21.  Веб-технології</p>
                            <p>22.  Технологічна (виробнича) практика</p>
                            <p>23.  Соціально-політичні студії </p>
                            <p>24.  Вибрані розділи трудового права і основ підприємницької діяльності</p>
                            <p>25.  Переддипломна (виробнича) практика </p>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>
</div>

<?php include("footer.php"); ?>
