<?php include("header.php"); ?>

<div class="container">
    <div class="clearfix services-header-container margin-top">
        <div class="services-header">
            <h2>Комерційні послуги кафедри з використанням IT-технологій</h2>
        </div>
    </div>
    <section>
        <div class="services-container">
            <div class='services-list'>
                <hr>
                <div class="service-item">
                   <div id="target">
                        <h2 style="text-align:center">Web та мережі</h2>
                    </div>
                    <div class="clearfix wrapper">
                        <div class="col-md-3 bg-text">
                            <p>Послуги з розробки програмного забезпечення для роботи з Інтернетом</p>
                            <p>Послуги з розробки програмного забезпечення для веб-серверів </p>
                            <p>Послуги з розробки програмного забезпечення для редагування веб-сторінок</p>
                            <p>Послуги з розробки програмного забезпечення для створення форм і бланків</p>
                            <p>Послуги з розробки програмного забезпечення для відеоконференцій</p>
                            <p>Інтернет-послуги</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>Послуги з розробки комунікаційного програмного забезпечення </p>
                            <p>Послуги з розробки програмного забезпечення для роботи з віддаленим доступом</p>
                            <p>Послуги з розробки програмного забезпечення для проведення аукціонів</p>
                            <p>Послуги з розробки комунікаційного та мультимедійного програмного забезпечення</p>
                            <p>Послуги у сфері розвитку Інтернету</p>
                            <p>Послуги з підтримки користувачів</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>Послуги з розробки програмного забезпечення для створення шаблонів</p>
                            <p>Послуги з розробки програмного забезпечення для обміну інформацією</p>
                            <p>Послуги провайдерів</p>
                            <p>Постачальники Інтернет-послуг</p>
                            <p>Постачальники послуг електронної пошти</p>
                            <p>Послуги з розробки веб-сайтів</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>Послуги з розробки програмного забезпечення для управління контентом</p>
                            
                            <p>Послуги з розробки клієнтських застосунків для роботи в мережах Інтернет та Інтранет</p>
                            <p>Послуги з розробки застосунків для роботи з серверами через мережі Інтернет та Інтранет</p>
                            <p>Послуги у сфері комп’ютерних мереж</p>
                            <p>Послуги у сфері локальних мереж </p>
                            <p>Послуги у сфері глобальних мереж</p>
                        </div>
                    </div>
                </div>   
                <hr>
                <div class="service-item">
                   <div id="target">
                        <h2 style="text-align:center">Програмне забезпечення</h2>
                    </div>
                    <div class="clearfix wrapper">
                        <div class="col-md-3 bg-text2">
                            <p>Послуги з розробки програмного забезпечення для роботи з документами, графікою, зображеннями</p>
                            <p>Послуги з програмування та консультаційні послуги з питань програмного забезпечення</p>
                            <p>Послуги з розробки пакетів програмного забезпечення</p>
                            <p>Послуги з розробки системного та користувацького програмного забезпечення</p>
                            <p>Консультаційні послуги з питань комп’ютерного аудиту та комп’ютерного апаратного забезпечення</p>
                            <p>Послуги з розробки прикладного програмного забезпечення</p>
                            <p>Послуги з розробки програмного забезпечення для підготовки податкової звітності</p>
                            <p>Послуги з розробки закупівельного програмного забезпечення</p>
                            <p>Послуги з розробки програмного забезпечення для редагування музики чи звуку</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>Послуги з розробки галузевого програмного забезпечення</p>
                            <p>Послуги з розробки програмного забезпечення для автоматизованих точок продажу</p>
                            <p>Послуги з розробки програмного забезпечення для керування виробничими процесами</p>
                            <p>Послуги з розробки програмного забезпечення для бібліотек</p>
                            <p>Послуги з розробки програмного забезпечення для контролю відповідності</p>
                            <p>Послуги з розробки медичного програмного забезпечення</p>
                            <p>Послуги з розробки програмного забезпечення для управління інвестиціями</p>
                            <p>Послуги з розробки програмного забезпечення для адміністративно-господарського управління</p>
                            <p>Послуги з розробки програмного забезпечення для бухгалтерського обліку</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>Послуги з розробки освітнього програмного забезпечення</p>
                            <p>Послуги з розробки програмного забезпечення для обробки транзакцій</p>
                            <p>Послуги з розробки програмного забезпечення для управління ліцензіями</p>
                            <p>Послуги з розробки програмного забезпечення для оптимізації операційних систем</p>
                            <p>Послуги з розробки програмного забезпечення для оптичного розпізнавання символів</p>
                            <p>Послуги з розробки програмного забезпечення для розпізнавання голосу</p>
                            <p>Послуги з розробки програмного забезпечення для креслення та малювання</p>
                            <p>Послуги з розробки програмного забезпечення для планування ресурсів підприємства</p>
                            <p>Послуги з розробки математичного чи прогнозувального програмного забезпечення</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>Послуги з розробки програмного забезпечення для роботи з презентаціями</p>
                            <p>Послуги з розробки програмного забезпечення для редагування текстів</p>
                            <p>Послуги з розробки програмного забезпечення для сканерів</p>
                            <p>Послуги з розробки програмного забезпечення для автоматизованих систем проектування/p>
                            <p>Послуги з розробки графічного програмного забезпечення </p>
                            <p>Послуги з розробки програмного забезпечення для автоматизації виробництва/p>
                            <p>Послуги з розробки програмного забезпечення для роботи з діаграмами</p>
                            <p>Послуги з розробки програмного забезпечення для створення комп’ютерних ігор</p>
                            <p>Послуги з розробки мов та засобів програмування</p>
                        </div>
                    </div>
                </div>
                <hr>
                <div class="service-item">
                   <div id="target">
                        <h2 style="text-align:center">Робота з даними</h2>
                    </div>
                    <div class="clearfix wrapper">
                        <div class="col-md-3 bg-text">
                            <p>Послуги у сфері управління даними</p>
                            <p>Послуги з обробки даних</p>
                            <p>Послуги з перетворення даних</p>
                            <p>Послуги з пакетної обробки даних</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>Послуги зі введення даних</p>
                            <p>Послуги з підготовки даних</p>
                            <p>Послуги зі збирання та зіставлення даних</p>
                            <p>Послуги з керування мережами даних і з підтримки мереж даних</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>Послуги з аналізу даних</p>
                            <p>Послуги зі зберігання даних</p>
                            <p>Послуги з постачання даних</p>
                            <p>Послуги, пов’язані з базами даних</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>Послуги зі стандартизації та класифікації контенту та даних</p>
                            <p>Послуги з розробки програмного забезпечення для захисту даних</p>
                            <p>Послуги з розробки програмного забезпечення для захисту файлів</p>
                            <p>Послуги з розробки програмного забезпечення для баз даних</p>
                        </div>
                    </div>
                </div>
                <hr>
                <div class="service-item">
                   <div id="target">
                        <h2 style="text-align:center">Консультаційні послуги</h2>
                    </div>
                    <div class="clearfix wrapper">
                        <div class="col-md-3 bg-text2">
                            <p>Консультаційні послуги з питань апаратного забезпечення</p>
                            <p>Консультаційні послуги з питань підбору апаратного забезпечення</p>
                            <p>Консультаційні послуги з питань аварійного відновлення апаратного забезпечення</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>Консультаційні послуги з питань планування розташування комп’ютерного обладнання</p>
                            <p>Консультаційні послуги з питань приймальних випробувань комп’ютерного апаратного забезпечення</p>
                            <p>Консультаційні послуги з питань комп’ютерного аудиту та комп’ютерного апаратного забезпечення</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>Послуги з програмування та консультаційні послуги з питань програмного забезпечення</p>
                            <p>Послуги з розробки службового програмного забезпечення загального призначення</p>
                            <p>Консультаційні послуги з питань систем та з технічних питаннях</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>Консультаційні послуги з питань аналізу господарської діяльності</p>
                            <p>Послуги у сфері інформаційних технологій</p>
                            <p>Послуги з аналізу вимог до інформаційних технологій</p>
                        </div>
                    </div>
                </div>
                <hr>
                <div class="service-item">
                   <div id="target">
                        <h2 style="text-align:center">Апаратне забезпечення</h2>
                    </div>
                    <div class="clearfix wrapper">
                        <div class="col-md-3 bg-text">
                            <p>Послуги з планування впроваджування систем</p>
                            <p>Послуги з планування забезпечення якості систем</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>Послуги з оцінювання та аналізу ефективності забезпечення якості систем</p>
                            <p>Консультаційні послуги з питань інтеграції апаратного забезпечення</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>Послуги з тестування комп’ютерного обладнання</p>
                        </div>
                        <div class="col-md-3 bg-text">
                            <p>Послуги з резервного копіювання та перетворення каталогів</p>
                        </div>
                    </div>
                </div>
                <hr>
                <div class="service-item">
                   <div id="target">
                        <h2 style="text-align:center">Траснпортні технології</h2>
                    </div>
                    <div class="clearfix wrapper">
                        <div class="col-md-3 bg-text2">
                            <p>Послуги з розробки програмного забезпечення для автоматизованих систем управління польотами</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>Послуги з розробки програмного забезпечення для систем керування повітряним рухом</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>Послуги з розробки програмного забезпечення для наземних засобів забезпечення польотів та випробувань авіаційної техніки</p>
                        </div>
                        <div class="col-md-3 bg-text2">
                            <p>Послуги з розробки програмного забезпечення для наземних засобів забезпечення польотів</p>
                        </div>
                    </div>
                </div>
                <hr>
            </div>
        </div>
    </section>
</div>

<?php include("footer.php"); ?>
