<?php  include_once 'header.php'; ?>
<div class="margin-top">
    <div class="employee-wrapper">
        <div class="container">
            <div class="single-employee-sidebar">
                <div class="employee-image">
                    <img src="img/0.jpg"/>
                </div>
                <div class="employee-content">
                    <h2 class="center-text">Имя Фамилия Отчество</h2>
                </div>
            </div>
            <div class="single-employee-content">
                <div class="column-container clearfix">
                    <div class="employee-text">
                        <h2><strong>Освіта&nbsp;</strong></h2>

                        <p>Доцент, кандидат фізико-математичних наук, завідувач кафедри.</p>

                        <p>У 1989 році закінчив факультет кібернетики Київського державного університету ім.Т.Г.Шевченка за спеціальністю прикладна математика.</p>

                        <p>У 1994 захистив дисертацію канд. фіз.-мат. наук 01.05.01 &laquo;математична кібернетика&raquo; за темою &laquo;Побудова оптимальних якісних характеристик стохастичних диференціальних рівнянь нейтрального типу&raquo;.</p>

                        <p>У 2011р. пройшов курси підвищення кваліфікації CISCO CCNA. У 2014р. пройшов курси підвищення кваліфікації Microsoft &ldquo;Програмування на С# з використанням Microsoft.NET&rdquo;.</p>

                        <h2><strong>Основні наукові досягнення&nbsp;</strong></h2>

                        <p>Для дослідження стійкості функціонально-диференціальних рівнянь мною введене поняття оптимальних функцій Ляпунова. Вперше отримано умови існування додатно визначеного розв&rsquo;язку матричного рівняння Сільвестра та побудовано алгоритм його пошуку.</p>

                        <p>Побудовано теоретичні засади &laquo;Теорії можливості&raquo;. Розроблено розширену теорію можливостей із застосуванням двох мір &ndash; міри можливостей та міри необхідностей. Доведено фундаментальні теореми про продовження цих мір з алгебри на булеан за довільною адитивністю, що суттєво відрізняє теорію можливостей від теорії ймовірностей..</p>

                        <p>У рамках теорії можливостей введено новий тип інтегралів та побудовано нове диференціальне рівняння. Доведено фундаментальні теореми про існування та єдиність розв&rsquo;язку цього диференціального рівняння, про продовження розв&rsquo;язку та про неперервну залежність розв&rsquo;язку від параметрів та початкових розумів. При дослідженні складної динаміки використовуються гібридні автомати. Мною запропоновано новий алгоритм дослідження стійкості стаціонарних станів гібридних автоматів. Доведено відповідні теореми про стійкість.</p>

                        <p>Розв&rsquo;язав відкриту проблему про необхідні та достатні умови існування додатної матриці, яка є розв&rsquo;язком матричного рівняння Ляпунова на конусі (копозитивна матриця).</p>

                        <p>Проведено аналіз обчислювальної ефективності різних мов і технологій програмування.</p>

                        <h2><strong>Володіння ІТ</strong></h2>

                        <p>Володіє мовами програмування C,C++, C#, Java, Phyton. Фахівець з об&rsquo;єктно-орієнтованого і функціонального програмування.</p>

                    </div>
                </div>
            </div>
        </div>
    </div>
</div>

<?php  include_once 'footer.php'; ?>